#1、--------------------------print()------------------------
# print("hello world!") #字符串
# print(2333) #整数
# print(2.333) #浮点数
# print(True) #布尔值
# print(()) #元祖
# print({}) # 列表
# print({}) #字典

# #-----------注释---------
# """
# 锄禾日当午
# 汗滴禾下土
# """

# #----------字符串拼接、运算---------
# print("哈哈",23333,2.333)
# print("哈哈"+"嘻嘻") # 字符串的拼接
# print("哈哈哈"*100)
# print(((1+2)*100-99)/2)
# print(2>3) #输出Flase
# print(10//3) #输出3
# print(16.7//3) #输出5.0
# print(10/3) #输出3.3333333333333335
# print(9/3) #输出3.0

# #----------变量、赋值-------
# name = "张三" # 把张三这个值赋值给了名字叫做name的这个变量
# print(name)


#2、----------------------------input()------------------------
# a = float(input("请输入：")) # 通过input获取的内容都是字符串
# b = float(input("请输入："))
# print("input获取的内容：",a+b)


#3、--------------------------数据格式的转换-------------------
# print(type("哈哈哈哈"))
# print(type(2333))
# print(type(2.3333))
# print(type(True))
# print(type(()))
# print(type([]))
# print(type({}))

# a = str(2333)
# print(type(a))

#4、-------------------------------len()------------------------
# a = '哈哈哈'
# print(len(a)) #3

#5、--------------------------------练习-----------------------
#通过代码获取两段内容，并且计算他们的长度的和
# a = input("请输入第一段内容：")
# b = input("请输入第二段内容：")
# print("两段内容长度的和：",len(a+b))

#6、--------------------------------元祖、下标，从0开始编号------------------------
# a = (1,2,3,4,"哈哈","哈哈","哈哈","哈哈","哈哈","嘻嘻",True,False) 
# print(a[4]) #输出：哈哈
# print(a.index("哈哈")) #输出4，当有很多个重复值时，获取第一个下标
# print(a.count("哈哈")) #输出5，count()统计值的数量

#-----------切片：左闭右开原则；最右是-1------------------
# print(a[:4]) # 输出(1, 2, 3, 4)
# print(a[4:9]) # 输出('哈哈', '哈哈', '哈哈', '哈哈', '哈哈')
# print(a[9:]) # 输出('哈哈', '哈哈', '哈哈', '哈哈', '哈哈')
# print(a[:]) # 输出全部

#-------------二维元祖------------
# b = (a,"哈哈","嘻嘻")
# print(b[0][3]) #输出4

#7、---------------------------------列表-----------------------------------------
#列表和元祖的区别：元祖写好后不可以修改，而数组是可以修改的
#下标不要超出范围 = 越界
# a = [1,2,3,4,"哈哈","嘻嘻",True,False]
# print(a[4]) #输出：哈哈
# a.append("append")  #追加
# a.insert(4,"insert") #插入
# print(a)
# b = a.pop(0) #剪切，有返回值
# c = a.pop(0)
# print(b+c) #输出3
# print(a)
# print(b) 

# x = ["你好","不好"]
# a.extend(x) #把列表追加到后面
# print(a)
# print(a+x)

# a.remove("哈哈") #把某个值移除
# a.remove(0)  #移除Flase
# a.remove(1) #移除True
# xx = [0,False,1,True]
# num = xx.count(0)
# print(num) #输出2，因为False也是0

# # a.clear() #清空
# print(a)

#8、-----------------------------------字典----------------------------------
"""
字典的特点：
1、字典中的值没有顺序
2、字典的结构必须是 键值对 的结构。key:value
3、字典的取值是通过key取value
"""
# a = {"name":"张三",0:"哈哈","age":25}
# #---------------取值-----------
# #二者区别：输入一个不存在的键，方式一会报错，方式二返回None
# #取值方式一
# print(a["name"]) #输出：张三
# #取值方式二：
# name1 = a.get("name")
# print(name1) #输出张三
# #---------------新增------------
# a["high"] = "183cm"
# print(a)
# #---------------修改-------------
# #方式一
# a["name"] = "李四"
# print(a)
# #方式二
# a.update(name=1111)
# print(a)
# #---------------剪切-------------
# name2 = a.pop("name")
# print(name2)
# print(a)

#9、------------------------------------------列表和字典的删除--------------------------------
# del a["name"] #字典的删除
# print(a)
# del a[0] #列表的删除

#10-----------------------------------------------练习-------------------------------------
"""
获取用户输入的个人信息，并且存储到字典中
个人信息包括了：name、age、sex
"""
name = input("Please input your name：")
age = input("Please input your age：")
gender = input("Please input your gender:")
user_infor = {"name":name,"age":age,"gender":gender}
print(user_infor)