#1、--------------------------print()------------------------
# print("hello world!") #字符串
# print(2333) #整型
# print(2.333) #浮点型
# print(True) #布尔值
# print(()) #元祖
# print({}) # 列表
# print({}) #字典

# #-----------注释---------
# """
# 锄禾日当午
# 汗滴禾下土
# """

# #----------字符串拼接、运算---------
# print("哈哈",23333,2.333)
# print("哈哈"+"嘻嘻") # 字符串的拼接
# print("哈哈哈"*100)
# print(((1+2)*100-99)/2)
# print(2>3) #输出Flase

# #----------变量、赋值-------
# name = "张三" # 把张三这个值赋值给了名字叫做name的这个变量
# print(name)


#2、----------------------------input()------------------------
# a = float(input("请输入：")) # 通过input获取的内容都是字符串
# b = float(input("请输入："))
# print("input获取的内容：",a+b)


#3、--------------------------数据格式的转换-------------------
# print(type("哈哈哈哈"))
# print(type(2333))
# print(type(2.3333))
# print(type(True))
# print(type(()))
# print(type([]))
# print(type({}))

# a = str(2333)
# print(type(a))

#4、-------------------------------len()------------------------
# a = '哈哈哈'
# print(len(a)) #3

#5、--------------------------------练习-----------------------
#通过代码获取两段内容，并且计算他们的长度的和
# a = input("请输入第一段内容：")
# b = input("请输入第二段内容：")
# print("两段内容长度的和：",len(a+b))